<a href="https://colab.research.google.com/github/nadhybrandao/Atividades_Praticas_WoMarkersCode/blob/main/WoMakersCode_Banco_de_Dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Introdução

1. Crie uma tabela chamada "alunos" com os seguintes campos: id
(inteiro), nome (texto), idade (inteiro) e curso (texto).
2. Insira pelo menos 5 registros de alunos na tabela que você criou no
exercício anterior.
3. Consultas Básicas
Escreva consultas SQL para realizar as seguintes tarefas:
* a) Selecionar todos os registros da tabela "alunos".
* b) Selecionar o nome e a idade dos alunos com mais de 20 anos.
* c) Selecionar os alunos do curso de "Engenharia" em ordem
alfabética.
* d) Contar o número total de alunos na tabela
4. Atualização e Remoção
* a) Atualize a idade de um aluno específico na tabela.
* b) Remova um aluno pelo seu ID.
5. Criar uma Tabela e Inserir Dados
Crie uma tabela chamada "clientes" com os campos: id (chave
primária), nome (texto), idade (inteiro) e saldo (float). Insira alguns
registros de clientes na tabela.
6. Consultas e Funções Agregadas
Escreva consultas SQL para realizar as seguintes tarefas:
* a) Selecione o nome e a idade dos clientes com idade superior a
30 anos.
* b) Calcule o saldo médio dos clientes.
* c) Encontre o cliente com o saldo máximo.
* d) Conte quantos clientes têm saldo acima de 1000.
7. Atualização e Remoção com Condições
* a) Atualize o saldo de um cliente específico.
* b) Remova um cliente pelo seu ID.
8. Junção de Tabelas
Crie uma segunda tabela chamada "compras" com os campos: id
(chave primária), cliente_id (chave estrangeira referenciando o id
da tabela "clientes"), produto (texto) e valor (real). Insira algumas
compras associadas a clientes existentes na tabela "clientes".
Escreva uma consulta para exibir o nome do cliente, o produto e o
valor de cada compra.

In [ ]:
import sqlite3
import pandas as pd

# Criando a conexão com o banco de dados SQLite (arquivo local)
conn = sqlite3.connect('meu_banco.db')
cursor = conn.cursor()

# Questão 01

In [ ]:
#Crie uma tabela chamada "alunos" com os seguintes campos: id (inteiro), nome (texto), idade (inteiro) e curso (texto).

cursor.execute('''
CREATE TABLE alunos (
    id INTEGER PRIMARY KEY,
    nome TEXT,
    idade INTEGER,
    curso TEXT
)
''')

OperationalError: table alunos already exists

# Questão 02

In [ ]:
# Insira pelo menos 5 registros de alunos na tabela que você criou no exercício anterior.
alunos = [
    (1, 'João Silva', 22, 'Engenharia'),
    (2, 'Maria Souza', 19, 'Direito'),
    (3, 'Pedro Alves', 25, 'Medicina'),
    (4, 'Ana Costa', 21, 'Engenharia'),
    (5, 'Lucas Pereira', 18, 'Arquitetura')
]

cursor.executemany('INSERT INTO alunos (id, nome, idade, curso) VALUES (?, ?, ?, ?)', alunos)

# Questão 03

In [ ]:
# Consultas Básicas Escreva consultas SQL para realizar as seguintes tarefas:
# a) Selecionar todos os registros da tabela "alunos".
# b) Selecionar o nome e a idade dos alunos com mais de 20 anos.
# c) Selecionar os alunos do curso de "Engenharia" em ordem alfabética.
# d) Contar o número total de alunos na tabela

consulta_a = pd.read_sql_query('SELECT * FROM alunos', conn)
print("Todos os registros da tabela 'alunos':")
print(consulta_a)

consulta_b = pd.read_sql_query('SELECT nome, idade FROM alunos WHERE idade > 20', conn)
print("\nNome e idade dos alunos com mais de 20 anos:")
print(consulta_b)

consulta_c = pd.read_sql_query('SELECT * FROM alunos WHERE curso = "Engenharia" ORDER BY nome', conn)
print("\nAlunos do curso de Engenharia em ordem alfabética:")
print(consulta_c)

consulta_d = pd.read_sql_query('SELECT COUNT(*) AS total_alunos FROM alunos', conn)
print("\nNúmero total de alunos:")
print(consulta_d)

Todos os registros da tabela 'alunos':
   id           nome  idade        curso
0   1     João Silva     22   Engenharia
1   2    Maria Souza     19      Direito
2   3    Pedro Alves     25     Medicina
3   4      Ana Costa     21   Engenharia
4   5  Lucas Pereira     18  Arquitetura

Nome e idade dos alunos com mais de 20 anos:
          nome  idade
0   João Silva     22
1  Pedro Alves     25
2    Ana Costa     21

Alunos do curso de Engenharia em ordem alfabética:
   id        nome  idade       curso
0   4   Ana Costa     21  Engenharia
1   1  João Silva     22  Engenharia

Número total de alunos:
   total_alunos
0             5

# Questão 04

In [ ]:
# Atualização e Remoção
# a) Atualize a idade de um aluno específico na tabela.
# b) Remova um aluno pelo seu ID.

cursor.execute('UPDATE alunos SET idade = 23 WHERE id = 1')
conn.commit()

cursor.execute('DELETE FROM alunos WHERE id = 5')
conn.commit()

# Questão 05

In [ ]:
# Criar uma Tabela e Inserir Dados Crie uma tabela chamada "clientes" com os campos: id (chave primária), nome (texto), idade (inteiro) e saldo (float). Insira alguns registros de clientes na tabela.
CREATE TABLE clientes (
    id INTEGER PRIMARY KEY,
    nome TEXT,
    idade INTEGER,
    saldo FLOAT
);

-- Inserindo registros na tabela "clientes"
INSERT INTO clientes (id, nome, idade, saldo) VALUES (1, 'Carlos Martins', 35, 1500.00);
INSERT INTO clientes (id, nome, idade, saldo) VALUES (2, 'Fernanda Lima', 28, 800.00);
INSERT INTO clientes (id, nome, idade, saldo) VALUES (3, 'Juliana Carvalho', 40, 1200.00);
INSERT INTO clientes (id, nome, idade, saldo) VALUES (4, 'Roberto Almeida', 50, 3000.00);
INSERT INTO clientes (id, nome, idade, saldo) VALUES (5, 'Patrícia Gonçalves', 32, 950.00);

SyntaxError: invalid syntax (<ipython-input-10-78215c843493>, line 2)

# Questão 06

In [ ]:
# Consultas e Funções Agregadas Escreva consultas SQL para realizar as seguintes tarefas:
# a) Selecione o nome e a idade dos clientes com idade superior a 30 anos.
# b) Calcule o saldo médio dos clientes.
# c) Encontre o cliente com o saldo máximo.
# d) Conte quantos clientes têm saldo acima de 1000.

SELECT nome, idade FROM clientes WHERE idade > 30;

SELECT AVG(saldo) AS saldo_medio FROM clientes;

SELECT nome, saldo FROM clientes WHERE saldo = (SELECT MAX(saldo) FROM clientes);

SELECT COUNT(*) AS clientes_com_saldo_acima_1000 FROM clientes WHERE saldo > 1000;

SyntaxError: invalid syntax (<ipython-input-11-1bd47fbb20e4>, line 7)

# Questão 07

In [ ]:
# Atualização e Remoção com Condições
# a) Atualize o saldo de um cliente específico.
# b) Remova um cliente pelo seu ID.

UPDATE clientes SET saldo = 1600.00 WHERE id = 1;  -- Exemplo: atualiza o saldo do cliente com id = 1

DELETE FROM clientes WHERE id = 2;  -- Exemplo: remove o cliente com id = 2

# Questão 08

In [ ]:
# Junção de Tabelas Crie uma segunda tabela chamada "compras" com os campos: id (chave primária), cliente_id (chave estrangeira referenciando o id da tabela "clientes"), produto (texto) e valor (real). Insira algumas compras associadas a clientes existentes na tabela "clientes". Escreva uma consulta para exibir o nome do cliente, o produto e o valor de cada compra.
CREATE TABLE compras (
    id INTEGER PRIMARY KEY,
    cliente_id INTEGER,
    produto TEXT,
    valor REAL,
    FOREIGN KEY (cliente_id) REFERENCES clientes(id)
);

-- Inserindo registros na tabela "compras"
INSERT INTO compras (id, cliente_id, produto, valor) VALUES (1, 1, 'Notebook', 2500.00);
INSERT INTO compras (id, cliente_id, produto, valor) VALUES (2, 3, 'Smartphone', 1500.00);
INSERT INTO compras (id, cliente_id, produto, valor) VALUES (3, 4, 'Televisão', 2000.00);
INSERT INTO compras (id, cliente_id, produto, valor) VALUES (4, 5, 'Geladeira', 3000.00);
INSERT INTO compras (id, cliente_id, produto, valor) VALUES (5, 1, 'Cadeira Gamer', 800.00);